Revit 2027 API
SystemZoneElementType.HeatingSetPoint Property
 The heating temperature set point in unit Kelvin (K).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HeatingSetPoint { get; set; }
Public Property HeatingSetPoint As Double
	Get
	Set
public:
property double HeatingSetPoint {
	double get ();
	void set (double value);
}
member HeatingSetPoint : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property:
See Also
Reference
SystemZoneElementType Class
Autodesk.Revit.DB.Mechanical Namespace